print("Вікторина")
print("Ви маєте відповісти на 5 питань")
print("Вказувати велику літеру")
print()
n=0
print("питання №1")
print("Який орган є найблільшим в організмі людини?")
print("A-серце,B-шкіра,C-печінка")
x=input("?")
if x=="B":
    print("Вірно")
    n=n+1
else:
    print("Нажаль не вірно.Правильна відповідь літера - B ")
print("питання №2")
print("Який роман відкривається і закривається листами Роберта Уолтона?")
print("A-Франкенштейн,B-Дон Кіхот,C-После")
x=input("?")
if x=="A":
    print("Вірно")
    n=n+1
else:
    print("Нажаль не вірно.Правильна відповідь літера - A ")
print("питання №3")
print("Яка книга про Гаррі Поттера є найдовшою у серії?")
print("A-Гаррі Поттер і таємна кімната,B - Гаррі Поттер і філософський камінь,C-Гаррі Поттер і Орден Фенікса")
x=input("?")
if x=="C":
    print("Вірно")
    n=n+1
else:
    print("Нажаль не вірно.Правильна відповідь літера - C ")
print("питання №4?")
print("Який материк найбільший?")
print("A-Азія,B-Африка,C-Пн.Америка")
x=input("?")
if x=="A":
    print("Вірно")
    n=n+1
else:
    print("Нажаль не вірно.Правильна відповідь літера - A ")
print("питання №5")
print("У якому році помер Майкл Джексон?")
print("A-2010,B-2008,C-2009")
x=input("?")
if x=="C":
    print("Вірно")
    n=n+1
else:
    print("Нажаль не вірно.Правильна відповідь літера - C ")
print("Правильних відповідей",n,"що складає",n/5*100,"%")










    
    
